<?php
// Цілі числа
$a = 10;
$b = 5;

// Рядки
$c = "10";
$d = "5";

// Порівняння цілих чисел
if ($a > $b) {
    echo "$a більше за $b<br>";
} elseif ($a < $b) {
    echo "$a менше за $b<br>";
} else {
    echo "$a дорівнює $b<br>";
}

// Порівняння рядків
if ($c == $d) {
    echo "$c дорівнює $d<br>";
} else {
    echo "$c не дорівнює $d<br>";
}

// Порівняння рядків з врахуванням типу даних
if ($c === $d) {
    echo "$c дорівнює $d (з врахуванням типу даних)<br>";
} else {
    echo "$c не дорівнює $d (з врахуванням типу даних)<br>";
}
?>